app/controllers/appointments_controller.rb

SELECT `appointments`.* FROM `appointments`
---
  def Agenda
    @appointments = Appointment.order(params[:date])

INSERT INTO `appointments` (`name`, `lastname`, `dentist_id`, `begin`, `end`, `date`, `created_at`, `updated_at`) VALUES ('Pablo', 'Obama', 2, '2016-04-30 08:00:00.000000', '2016-04-30 08:30:00.000000', '2016-05-18', '2016-04-30 22:43:45', '2016-04-30 22:43:45')
---
  def CrearConsulta
    @appointment = Appointment.new(appointment_params)
    if @appointment.save

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 2 LIMIT 1
---
  def MostrarConsulta
    @appointment = Appointment.find(params[:id])

UPDATE `appointments` SET `name` = 'Pablo', `lastname` = 'Obama', `cost` = 0.0, `treatments` = 'Amalgamas y resina en todos sus dientecitos porque lo necesita', `diagnostic` = 'Diez mil peluchólares', `begin` = '2000-01-01 08:00:00.000000', `date` = '2016-05-18', `updated_at` = '2016-04-30 22:44:42' WHERE `appointments`.`id` = 2
---
  def ModificarConsulta
    @appointment = Appointment.find_by(params[:id])
    if @appointment.update_attributes(appointment_params)

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 2 LIMIT 1
DELETE FROM `appointments` WHERE `appointments`.`id` = 2
---
  def BorrarConsulta
    @appointment = Appointment.find(params[:id])
    @appointment.destroy