app/controllers/assistants_controller.rb

SELECT `assistants`.* FROM `assistants`  ORDER BY id ASC
---
    def Asistentes
      @assistants = Assistant.order("id ASC")

SELECT `assistants`.* FROM `assistants` WHERE (name LIKE '%da%')
---
    def Buscar
      @assistants = Assistant.where("name LIKE ?","%#{params[:search]}%")

INSERT INTO `assistants` (`name`, `surname`, `address`, `phone`, `social_security_number`, `created_at`, `updated_at`) VALUES ('José', 'Feliciano', 'Av. Insurgentes', '7471485170', 'HDI912038', '2016-04-28 05:05:11', '2016-04-28 05:05:11')
---
    def CrearAsistente
      @assistant = Assistant.new(assistant_params)
      if @assistant.save

SELECT  `assistants`.* FROM `assistants` WHERE (7) LIMIT 1
---
    def MostrarAsistente
      @assistant = Assistant.find_by(params[:id])

SELECT  `assistants`.* FROM `assistants` WHERE (6) LIMIT 1
UPDATE `assistants` SET `surname` = 'Ledesma', `updated_at` = '2016-04-28 04:51:37' WHERE `assistants`.`id` = 6
---
    def ModificarAsistente
      @assistant = Assistant.find_by(params[:id])
      if @assistant.update_attributes(assistant_params)

SELECT  `assistants`.* FROM `assistants` WHERE (6) LIMIT 1
DELETE FROM `assistants` WHERE `assistants`.`id` = 6
---
    def BorrarAsistente
      @assistant = Assistant.find(params[:id])
      @assistant.destroy