app/controllers/dentists_controller.rb

  def Dentistas
    @dentists = Dentist.order("id ASC")
---
SELECT `dentists`.* FROM `dentists`  ORDER BY id ASC

  def Buscar
    @dentists = Dentist.where("name LIKE ?","%#{params[:search]}%")
---
SELECT `dentists`.* FROM `dentists` WHERE (name LIKE '%rau%')

  def CrearDentista
    @dentist = Dentist.new(dentist_params)
    if @dentist.save
---
INSERT INTO `dentists` (`name`, `surname`, `address`, `phone`, `rfc`, `mail`, `specialty`) VALUES ('Dra. Ivonne', 'Navarro', 'asdasd', '123456', 'asdad', 'asdasd', 'Cirugia')

  def MostrarDentista
    @dentist = Dentist.find_by(params[:id])
---
SELECT  `dentists`.* FROM `dentists` WHERE (2) LIMIT 1