app/controllers/materials_controller.rb

SELECT `materials`.* FROM `materials`  ORDER BY surname ASC
---
    def Inventario
      @materials = Material.order("name ASC")

SELECT `materials`.* FROM `materials` WHERE (name LIKE '%Reten%')
---
    def Buscar
      @materials = Material.where("name LIKE ?","%#{params[:search]}%")

SELECT  `materials`.* FROM `materials` WHERE `materials`.`id` = 2 LIMIT 1
---
    def MaterialDatos
      @material = Material.find(params[:id])

INSERT INTO `materials` (`name`, `quantity`, `supplier_id`) VALUES ('Brackets', 500, 2)
---
    def CrearMaterial
      @material = Material.new(material_params)
      if @material.save

SELECT  `materials`.* FROM `materials` WHERE (2) LIMIT 1
DELETE FROM `materials` WHERE `materials`.`id` = 1
---
    def BorrarMaterial
      @material = Material.find(params[:id])
      @material.destroy