app/controllers/patients_controller.rb

SELECT `patients`.* FROM `patients`  ORDER BY id ASC
---
  def Expediente
    @patients = Patient.order("id ASC")

SELECT `patients`.* FROM `patients` WHERE (name LIKE '%qwe%')
---
  def Buscar
    @patients = Patient.where("name LIKE ?","%#{params[:search]}%")

SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 10 LIMIT 1
---
  def PacienteExpediente
    @patient = Patient.find(params[:id])

INSERT INTO `patients` (`name`, `surname`, `lastname`, `birth_date`, `phone`, `cellphone`, `address`, `recomendation`, `parents`, `gender`, `mail`, `rfc`, `created_at`, `updated_at`) VALUES ('David', 'Huesca', 'Garay', '2014-08-07', '787408194', '893147109', 'Av. Chapultepec', 'Dr. Chapatín', 'Gilberto y René', 'Femenino', 'david@selacome.com', 'jdahmasj2342', '2016-04-26 20:00:00', '2016-04-26 20:00:00')
---
  def CrearPaciente
    @patient = Patient.new(patient_params)
    if @patient.save

SELECT  `patients`.* FROM `patients` WHERE (1) LIMIT 1
UPDATE `patients` SET `mail` = 'david@noselacometoda.com', `updated_at` = '2016-04-27 01:17:03' WHERE `patients`.`id` = 2
---
  def ModificarPaciente
    @patient = Patient.find_by(params[:id])
    if @patient.update_attributes(patient_params)

SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 5 LIMIT 1
DELETE FROM `patients` WHERE `patients`.`id` = 1
---
  def BorrarPaciente
    @patient = Patient.find(params[:id])
    @patient.destroy