app/controllers/suppliers_controller.rb

SELECT `suppliers`.* FROM `suppliers`  ORDER BY id ASC
---
  def Proveedores
    @suppliers = Supplier.order("id ASC")

SELECT `suppliers`.* FROM `suppliers` WHERE (name LIKE '%por%')
---
  def Buscar
    @suppliers = Supplier.where("name LIKE ?","%#{params[:search]}%")

SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = NULL LIMIT 1
---
  def DatosProveedores
    @supplier = Supplier.find(params[:id])

INSERT INTO `suppliers` (`name`, `address`, `phone`, `rfc`, `created_at`, `updated_at`) VALUES ('Hinduztris', 'Av. Chapultepec', '8034275', 'HDN82194', '2016-04-27 04:16:30', '2016-04-27 04:16:30')
---
  def CrearProveedor
    @supplier = Supplier.new(supplier_params)
    if @supplier.save

SELECT  `suppliers`.* FROM `suppliers` WHERE (1) LIMIT 1
UPDATE `suppliers` SET `address` = 'Av. Insurgentes', `updated_at` = '2016-04-27 04:47:18' WHERE `suppliers`.`id` = 1
---
  def ModificarProveedor
    @supplier = Supplier.find_by(params[:id])
    if @supplier.update_attributes(supplier_params)

SELECT  `suppliers`.* FROM `suppliers` WHERE (3) LIMIT 1
DELETE FROM `suppliers` WHERE `suppliers`.`id` = 1
---
  def BorrarProveedor
    @supplier = Supplier.find(params[:id])
    @supplier.destroy