app/views/appointments/Agenda.html.erb

                  <%= f.label(:dentist_id, "Dentista")%>
                  <%= f.collection_select(:dentist_id, Dentist.all,:id,:name) %>
---
SELECT `dentists`.* FROM `dentists`