app/views/appointments/MostrarConsulta.html.erb

          <%= f.label(:dentist_id, "Dentista")%>
          <%= f.collection_select(:dentist_id, Dentist.all,:id,:name) %>
---
SELECT `dentists`.* FROM `dentists`