app/views/materials/MaterialDatos.html.erb

                    <%= f.label(:supplier_id, "Proveedor")%>
                    <%= f.collection_select(:supplier_id,Supplier.all,:id,:name) %>
---
SELECT `suppliers`.* FROM `suppliers`